espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_memory.c
/***************************************************************************/ /**
 * @file
 * @brief CPC API implementation.
 *******************************************************************************
 * # License
 * <b>Copyright 2019 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stdlib.h>
#include <stddef.h>

#include "sl_status.h"

#include "sl_cpc_config.h"
#include "sli_cpc_system_common.h"
#include "sli_cpc.h"
#include "sli_cpc_hdlc.h"
#include "sli_mem_pool.h"
#include "sli_cpc_debug.h"
#include "sli_cpc_drv.h"
#include "sl_assert.h"

#if defined(SL_COMPONENT_CATALOG_PRESENT)
#include "sl_component_catalog.h"
#endif

/*******************************************************************************
 *********************************   DEFINES   *********************************
 ******************************************************************************/

#if (SL_CPC_DEBUG_MEMORY_ALLOCATOR_COUNTERS == 1)
#define MEM_POOL_ALLOC(mempool, block) { if (block != NULL) \
                                         { mempool->used_block_cnt++; } }

#define MEM_POOL_FREE(mempool) mempool->used_block_cnt--
#else
#define MEM_POOL_ALLOC(mempool, block)
#define MEM_POOL_FREE(mempool)
#endif

/*******************************************************************************
 ***************************  LOCAL VARIABLES   ********************************
 ******************************************************************************/
static sli_mem_pool_handle_t mempool_buffer_handle;
SLI_MEM_POOL_DECLARE_BUFFER_WITH_TYPE(mempool_buffer_handle,
                                      sl_cpc_buffer_handle_t,
                                      SLI_CPC_BUFFER_HANDLE_MAX_COUNT);

static sl_cpc_mem_pool_handle_t cpc_mempool_buffer_handle =
{ .pool_handle = &mempool_buffer_handle,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_hdlc_header;
SLI_MEM_POOL_DECLARE_BUFFER(mempool_hdlc_header,
                            SLI_CPC_HDLC_HEADER_RAW_SIZE,
                            SLI_CPC_HDLC_HEADER_MAX_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_hdlc_header =
{ .pool_handle = &mempool_hdlc_header,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_hdlc_reject;
SLI_MEM_POOL_DECLARE_BUFFER(mempool_hdlc_reject,
                            SLI_CPC_HDLC_REJECT_PAYLOAD_SIZE,
                            SLI_CPC_HDLC_REJECT_MAX_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_hdlc_reject =
{ .pool_handle = &mempool_hdlc_reject,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_rx_buffer;
SLI_MEM_POOL_DECLARE_BUFFER(mempool_rx_buffer,
                            SLI_CPC_RX_DATA_MAX_LENGTH,
                            SL_CPC_RX_BUFFER_MAX_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_rx_buffer =
{ .pool_handle = &mempool_rx_buffer,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_endpoint;
SLI_MEM_POOL_DECLARE_BUFFER_WITH_TYPE(mempool_endpoint,
                                      sl_cpc_endpoint_t,
                                      SLI_CPC_ENDPOINT_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_endpoint =
{ .pool_handle = &mempool_endpoint,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_rx_queue_item;
SLI_MEM_POOL_DECLARE_BUFFER_WITH_TYPE(mempool_rx_queue_item,
                                      sl_cpc_receive_queue_item_t,
                                      SLI_CPC_RX_QUEUE_ITEM_MAX_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_rx_queue_item =
{ .pool_handle = &mempool_rx_queue_item,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_tx_queue_item;
SLI_MEM_POOL_DECLARE_BUFFER_WITH_TYPE(mempool_tx_queue_item,
                                      sl_cpc_transmit_queue_item_t,
                                      SL_CPC_TX_QUEUE_ITEM_MAX_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_tx_queue_item =
{ .pool_handle = &mempool_tx_queue_item,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_tx_queue_item_sframe;
SLI_MEM_POOL_DECLARE_BUFFER_WITH_TYPE(mempool_tx_queue_item_sframe,
                                      sl_cpc_transmit_queue_item_t,
                                      SLI_CPC_TX_QUEUE_ITEM_SFRAME_MAX_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_tx_queue_item_sframe =
{ .pool_handle = &mempool_tx_queue_item_sframe,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_endpoint_closed_arg_item;
SLI_MEM_POOL_DECLARE_BUFFER_WITH_TYPE(mempool_endpoint_closed_arg_item,
                                      sl_cpc_endpoint_closed_arg_t,
                                      SL_CPC_TX_QUEUE_ITEM_MAX_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_endpoint_closed_arg_item =
{ .pool_handle = &mempool_endpoint_closed_arg_item,
  .used_block_cnt = 0 };

static sli_mem_pool_handle_t mempool_system_command;
SLI_MEM_POOL_DECLARE_BUFFER(mempool_system_command,
                            SLI_CPC_SYSTEM_COMMAND_BUFFER_SIZE,
                            SLI_CPC_SYSTEM_COMMAND_BUFFER_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_system_command =
{ .pool_handle = &mempool_system_command,
  .used_block_cnt = 0 };

#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
static sli_mem_pool_handle_t mempool_tx_security_tag;
SLI_MEM_POOL_DECLARE_BUFFER(mempool_tx_security_tag,
                            SLI_SECURITY_TAG_LENGTH_BYTES,
                            SL_CPC_TX_QUEUE_ITEM_MAX_COUNT);
static sl_cpc_mem_pool_handle_t cpc_mempool_tx_security_tag =
{ .pool_handle = &mempool_tx_security_tag,
  .used_block_cnt = 0 };
#endif

