espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_memory.c
extern sli_cpc_drv_capabilities_t sli_cpc_driver_capabilities;

/*******************************************************************************
 **************************   LOCAL FUNCTIONS   ********************************
 ******************************************************************************/

static void* alloc_object(sl_cpc_mem_pool_handle_t *pool);

static void free_object(sl_cpc_mem_pool_handle_t *pool,
                        void *block);

/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

__WEAK void sli_cpc_memory_on_rx_buffer_free(void);

/***************************************************************************//**
 * Initialize CPC buffers' handling module.
 ******************************************************************************/
void sli_cpc_init_buffers(void)
{
  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_buffer_handle.pool_handle,
                      sizeof(sl_cpc_buffer_handle_t),
                      SLI_CPC_BUFFER_HANDLE_MAX_COUNT,
                      mempool_buffer_handle_buffer,
                      sizeof(mempool_buffer_handle_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_hdlc_header.pool_handle,
                      SLI_CPC_HDLC_HEADER_RAW_SIZE,
                      SLI_CPC_HDLC_HEADER_MAX_COUNT,
                      mempool_hdlc_header_buffer,
                      sizeof(mempool_hdlc_header_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_hdlc_reject.pool_handle,
                      SLI_CPC_HDLC_REJECT_PAYLOAD_SIZE,
                      SLI_CPC_HDLC_REJECT_MAX_COUNT,
                      mempool_hdlc_reject_buffer,
                      sizeof(mempool_hdlc_reject_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_rx_buffer.pool_handle,
                      SLI_CPC_RX_DATA_MAX_LENGTH,
                      SL_CPC_RX_BUFFER_MAX_COUNT,
                      mempool_rx_buffer_buffer,
                      sizeof(mempool_rx_buffer_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_endpoint.pool_handle,
                      sizeof(sl_cpc_endpoint_t),
                      SLI_CPC_ENDPOINT_COUNT,
                      mempool_endpoint_buffer,
                      sizeof(mempool_endpoint_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_rx_queue_item.pool_handle,
                      sizeof(sl_cpc_receive_queue_item_t),
                      SLI_CPC_RX_QUEUE_ITEM_MAX_COUNT,
                      mempool_rx_queue_item_buffer,
                      sizeof(mempool_rx_queue_item_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_tx_queue_item.pool_handle,
                      sizeof(sl_cpc_transmit_queue_item_t),
                      SL_CPC_TX_QUEUE_ITEM_MAX_COUNT,
                      mempool_tx_queue_item_buffer,
                      sizeof(mempool_tx_queue_item_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_tx_queue_item_sframe.pool_handle,
                      sizeof(sl_cpc_transmit_queue_item_t),
                      SLI_CPC_TX_QUEUE_ITEM_SFRAME_MAX_COUNT,
                      mempool_tx_queue_item_sframe_buffer,
                      sizeof(mempool_tx_queue_item_sframe_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_endpoint_closed_arg_item.pool_handle,
                      sizeof(sl_cpc_endpoint_closed_arg_t),
                      SL_CPC_TX_QUEUE_ITEM_MAX_COUNT,
                      mempool_endpoint_closed_arg_item_buffer,
                      sizeof(mempool_endpoint_closed_arg_item_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_endpoint_closed_arg_item.pool_handle,
                      sizeof(sl_cpc_endpoint_closed_arg_t),
                      SL_CPC_TX_QUEUE_ITEM_MAX_COUNT,
                      mempool_endpoint_closed_arg_item_buffer,
                      sizeof(mempool_endpoint_closed_arg_item_buffer));

  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_system_command.pool_handle,
                      SLI_CPC_SYSTEM_COMMAND_BUFFER_SIZE,
                      SLI_CPC_SYSTEM_COMMAND_BUFFER_COUNT,
                      mempool_system_command_buffer,
                      sizeof(mempool_system_command_buffer));

#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
  sli_mem_pool_create((sli_mem_pool_handle_t *)cpc_mempool_tx_security_tag.pool_handle,
                      SLI_SECURITY_TAG_LENGTH_BYTES,
                      SL_CPC_TX_QUEUE_ITEM_MAX_COUNT,
                      mempool_tx_security_tag_buffer,
                      sizeof(mempool_tx_security_tag_buffer));
#endif

  SLI_CPC_DEBUG_MEMORY_POOL_INIT();
}

/***************************************************************************//**
 * Get a CPC handle buffer
 ******************************************************************************/
sl_status_t sli_cpc_get_buffer_handle(sl_cpc_buffer_handle_t **handle)
{
  sl_cpc_buffer_handle_t *buf_handle;

  if (handle == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  buf_handle = alloc_object(&cpc_mempool_buffer_handle);
  if (buf_handle == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  buf_handle->hdlc_header = NULL;
  buf_handle->data = NULL;
#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
  buf_handle->security_tag = NULL;
#endif
  buf_handle->data_length = 0;
  buf_handle->endpoint = NULL;
  buf_handle->fcs[0] = 0;
  buf_handle->fcs[1] = 0;
  buf_handle->control = 0;
  buf_handle->address = 0;
  buf_handle->buffer_type = SL_CPC_UNKNOWN_BUFFER;
  buf_handle->arg = NULL;
  buf_handle->reason = SL_CPC_REJECT_NO_ERROR;
  buf_handle->ref_count = 0;

  *handle = buf_handle;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get a CPC header buffer
 ******************************************************************************/
sl_status_t sli_cpc_get_hdlc_header_buffer(void **header)
{
  if (header == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *header = alloc_object(&cpc_mempool_hdlc_header);
  if (*header == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

