espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_memory.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get a CPC header buffer for transmitting a reject
 ******************************************************************************/
sl_status_t sli_cpc_get_reject_buffer(sl_cpc_buffer_handle_t **handle)
{
  sl_status_t status;
  sl_cpc_buffer_handle_t *buf_handle;

  status = sli_cpc_get_buffer_handle(&buf_handle);
  if (status != SL_STATUS_OK) {
    return status;
  }

  buf_handle->data = alloc_object(&cpc_mempool_hdlc_reject);
  buf_handle->buffer_type = SL_CPC_HDLC_REJECT_BUFFER;

  if (buf_handle->data == NULL) {
    free_object(&cpc_mempool_buffer_handle, buf_handle);
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  buf_handle->data_length = 1;
  *handle = buf_handle;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get a CPC buffer for reception.
 ******************************************************************************/
sl_status_t sli_cpc_get_buffer_handle_for_rx(sl_cpc_buffer_handle_t **handle)
{
  sl_cpc_buffer_handle_t *buf_handle;
  sl_status_t status;

  if (handle == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  status = sli_cpc_get_buffer_handle(&buf_handle);
  if (status != SL_STATUS_OK) {
    return status;
  }

  sli_cpc_get_hdlc_header_buffer(&buf_handle->hdlc_header);
  if (buf_handle->hdlc_header == NULL) {
    free_object(&cpc_mempool_buffer_handle, buf_handle);
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  if (!sli_cpc_driver_capabilities.use_raw_rx_buffer) {
    buf_handle->data = alloc_object(&cpc_mempool_rx_buffer);
    if (buf_handle->data == NULL) {
      sli_cpc_free_hdlc_header(buf_handle->hdlc_header);
      free_object(&cpc_mempool_buffer_handle, buf_handle);
      return SL_STATUS_NO_MORE_RESOURCE;
    }
  } else {
    buf_handle->data = NULL;
  }

  buf_handle->data_length = 0u;
  buf_handle->buffer_type = SL_CPC_RX_BUFFER;
  buf_handle->reason = SL_CPC_REJECT_NO_ERROR;

  *handle = buf_handle;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get a CPC RAW buffer for reception.
 ******************************************************************************/
sl_status_t sli_cpc_get_raw_rx_buffer(void **raw_rx_buffer)
{
  EFM_ASSERT(sli_cpc_driver_capabilities.use_raw_rx_buffer);

  *raw_rx_buffer = alloc_object(&cpc_mempool_rx_buffer);
  if (*raw_rx_buffer == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get a CPC RAW buffer for reception.
 ******************************************************************************/
sl_status_t sli_cpc_free_raw_rx_buffer(void *raw_rx_buffer)
{
  EFM_ASSERT(sli_cpc_driver_capabilities.use_raw_rx_buffer);

  if (raw_rx_buffer != NULL) {
    free_object(&cpc_mempool_rx_buffer, raw_rx_buffer);
  } else {
    return SL_STATUS_NULL_POINTER;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free rx handle and all associate buffers
 ******************************************************************************/
sl_status_t sli_cpc_drop_buffer_handle(sl_cpc_buffer_handle_t *handle)
{
  bool is_rx_buffer = false;

  if (handle == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (handle->buffer_type == SL_CPC_RX_BUFFER) {
    is_rx_buffer = true;
  }

  if (handle->ref_count > 0) {
    // Can't free the buffer_handle, it is being used elsewhere
    return SL_STATUS_BUSY;
  }

  if (handle->data != NULL) {
    if (handle->buffer_type == SL_CPC_HDLC_REJECT_BUFFER) {
      free_object(&cpc_mempool_hdlc_reject, handle->data);
    } else if (handle->buffer_type == SL_CPC_RX_BUFFER) {
      free_object(&cpc_mempool_rx_buffer, handle->data);

#ifdef CPC_DEBUG_TRACE
      if (handle->endpoint != NULL) {
        SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_DATA_FRAME_DROPPED(handle->endpoint);
      } else {
        SLI_CPC_DEBUG_TRACE_CORE_RXD_DATA_FRAME_DROPPED();
      }
#endif
    } else {
      // If no type, it's a buffer used for transmit operation.
      // So no need to free any data since the buffer is passed by the application.
    }
  }

  if (handle->hdlc_header != NULL) {
    sli_cpc_free_hdlc_header(handle->hdlc_header);
  }

#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
  sli_cpc_free_security_tag_buffer(handle->security_tag);
#endif

  free_object(&cpc_mempool_buffer_handle, handle);

  if (is_rx_buffer) {
    // Notify that at least one RX buffer is available
    sli_cpc_memory_on_rx_buffer_free();
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Convert rx buffer handle to a receive queue item;
 *  Free hdlc header and handle
 *  Alloc queue item and set fields
 ******************************************************************************/
sl_status_t sli_cpc_push_back_rx_data_in_receive_queue(sl_cpc_buffer_handle_t *handle,
                                                       sl_slist_node_t **head,
                                                       uint16_t data_length)
{
  sl_cpc_receive_queue_item_t *item;
  sl_status_t status;

  if (handle == NULL || head == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  status = sli_cpc_get_receive_queue_item(&item);
  if (status != SL_STATUS_OK) {
    return status;
  }

  item->node.node = NULL;
  item->data = handle->data;
  item->buffer_type = handle->buffer_type;
  item->data_length = data_length;

  sl_slist_push_back(head, &item->node);

  sli_cpc_free_hdlc_header(handle->hdlc_header);
  free_object(&cpc_mempool_buffer_handle, handle);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free rx buffer returned by sl_cpc_read().
 ******************************************************************************/
sl_status_t sl_cpc_free_rx_buffer(void *data)
{
  if (data == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  free_object(&cpc_mempool_rx_buffer, data);

  // Notify that at least one RX buffer is available
  sli_cpc_memory_on_rx_buffer_free();

