espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_memory.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free CPC hdlc header
 ******************************************************************************/
sl_status_t sli_cpc_free_hdlc_header(void *data)
{
  if (data == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  free_object(&cpc_mempool_hdlc_header, data);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get receive queue item
 ******************************************************************************/
sl_status_t sli_cpc_get_receive_queue_item(sl_cpc_receive_queue_item_t **item)
{
  if (item == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *item = alloc_object(&cpc_mempool_rx_queue_item);
  if (*item == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free receive queue item
 ******************************************************************************/
sl_status_t sli_cpc_free_receive_queue_item(sl_cpc_receive_queue_item_t *item,
                                            void **data,
                                            uint16_t *data_length)
{
  if (item == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *data = item->data;
  *data_length = item->data_length;

  free_object(&cpc_mempool_rx_queue_item, item);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free receive queue item and the data buffer
 ******************************************************************************/
void sli_cpc_drop_receive_queue_item(sl_cpc_receive_queue_item_t *item)
{
  if (item == NULL) {
    return;
  }

  if (item->data != NULL) {
    if (item->buffer_type == SL_CPC_HDLC_REJECT_BUFFER) {
      free_object(&cpc_mempool_hdlc_reject, item->data);
    } else if (item->buffer_type == SL_CPC_RX_BUFFER) {
      free_object(&cpc_mempool_rx_buffer, item->data);

      // Notify that at least one RX buffer is available
      sli_cpc_memory_on_rx_buffer_free();
    }
  }

  free_object(&cpc_mempool_rx_queue_item, item);
}

/***************************************************************************//**
 * Get a transmit queue item.
 ******************************************************************************/
sl_status_t sli_cpc_get_transmit_queue_item(sl_cpc_transmit_queue_item_t **item)
{
  if (item == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *item = alloc_object(&cpc_mempool_tx_queue_item);
  if (*item == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free transmit queue item.
 ******************************************************************************/
sl_status_t sli_cpc_free_transmit_queue_item(sl_cpc_transmit_queue_item_t *item)
{
  if (item == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  free_object(&cpc_mempool_tx_queue_item, item);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get a transmit queue item from S-Frame.
 ******************************************************************************/
sl_status_t sli_cpc_get_sframe_transmit_queue_item(sl_cpc_transmit_queue_item_t **item)
{
  if (item == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *item = alloc_object(&cpc_mempool_tx_queue_item_sframe);
  if (*item == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free transmit queue item from S-Frame pool.
 ******************************************************************************/
sl_status_t sli_cpc_free_sframe_transmit_queue_item(sl_cpc_transmit_queue_item_t *item)
{
  if (item == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  free_object(&cpc_mempool_tx_queue_item_sframe, item);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get endpoint
 ******************************************************************************/
sl_status_t sli_cpc_get_endpoint(sl_cpc_endpoint_t **endpoint)
{
  if (endpoint == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *endpoint = alloc_object(&cpc_mempool_endpoint);
  if (*endpoint == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  memset(*endpoint, 0, sizeof(sl_cpc_endpoint_t));

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free endpoint
 ******************************************************************************/
void sli_cpc_free_endpoint(sl_cpc_endpoint_t *endpoint)
{
  free_object(&cpc_mempool_endpoint, endpoint);
}

/***************************************************************************//**
 * Get endpoint closed argument item
 ******************************************************************************/
sl_status_t sli_cpc_get_closed_arg(sl_cpc_endpoint_closed_arg_t **arg)
{
  if (arg == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *arg = alloc_object(&cpc_mempool_endpoint_closed_arg_item);
  if (*arg == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free endpoint closed argument item
 ******************************************************************************/
void sli_cpc_free_closed_arg(sl_cpc_endpoint_closed_arg_t *arg)
{
  free_object(&cpc_mempool_endpoint_closed_arg_item, arg);
}

/***************************************************************************//**
 * Push back a list item containing an allocated buffer handle
 ******************************************************************************/
void sli_cpc_push_back_buffer_handle(sl_slist_node_t **head, sl_slist_node_t *item, sl_cpc_buffer_handle_t *buf_handle)
{
  EFM_ASSERT(buf_handle != NULL);
  buf_handle->ref_count++;
  sl_slist_push_back(head, item);
}

/***************************************************************************//**
 * Push a list item containing an allocated buffer handle
 ******************************************************************************/
void sli_cpc_push_buffer_handle(sl_slist_node_t **head, sl_slist_node_t *item, sl_cpc_buffer_handle_t *buf_handle)
{
  EFM_ASSERT(buf_handle != NULL);
  buf_handle->ref_count++;
  sl_slist_push(head, item);
}

/***************************************************************************//**
 * Get a command buffer
 ******************************************************************************/
sl_status_t sli_cpc_get_system_command_buffer(sli_cpc_system_cmd_t **item)
{
  if (item == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *item = alloc_object(&cpc_mempool_system_command);
  if (*item == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

