espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/src/sl_cpc_memory.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Free a command buffer
 ******************************************************************************/
sl_status_t sli_cpc_free_command_buffer(sli_cpc_system_cmd_t *item)
{
  if (item == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  free_object(&cpc_mempool_system_command, item);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Allocate a security tag buffer
 ******************************************************************************/
sl_status_t sli_cpc_get_security_tag_buffer(void **tag_buffer)
{
#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
  if (tag_buffer == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *tag_buffer = alloc_object(&cpc_mempool_tx_security_tag);
  if (*tag_buffer == NULL) {
    return SL_STATUS_NO_MORE_RESOURCE;
  }

  return SL_STATUS_OK;
#else
  (void)tag_buffer;

  return SL_STATUS_NOT_AVAILABLE;
#endif
}

/***************************************************************************//**
 * Free a security tag buffer
 ******************************************************************************/
sl_status_t sli_cpc_free_security_tag_buffer(void *tag_buffer)
{
#if (SL_CPC_ENDPOINT_SECURITY_ENABLED >= 1)
  if (tag_buffer == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  free_object(&cpc_mempool_tx_security_tag, tag_buffer);

  return SL_STATUS_OK;
#else
  (void)tag_buffer;

  return SL_STATUS_NOT_AVAILABLE;
#endif
}

/***************************************************************************//**
 * Alloc object from a specified pool; Manage stat as well
 ******************************************************************************/
static void* alloc_object(sl_cpc_mem_pool_handle_t *pool)
{
  void *block;

  block = sli_mem_pool_alloc((sli_mem_pool_handle_t *)pool->pool_handle);
  MEM_POOL_ALLOC(pool, block);

  return block;
}

/***************************************************************************//**
 * Free object from a specified pool; Manage stat as well
 ******************************************************************************/
static void free_object(sl_cpc_mem_pool_handle_t *pool,
                        void *block)
{
  sli_mem_pool_free((sli_mem_pool_handle_t *)pool->pool_handle, block);
  MEM_POOL_FREE(pool);
}
